TestPlans/Car/Debenhams/xml/DCI3_21112014_10.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="www.openecommerce.co.uk">
  <soap:Body>
    <ns1:getQuote>
      <requestXML>&lt;Request&gt;
  &lt;Product&gt;Motor&lt;/Product&gt;
  &lt;AggregatorID&gt;CTM1708&lt;/AggregatorID&gt;
  &lt;Quote Id="1"&gt;
    &lt;BrokerReference&gt;SAB0513&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="2"&gt;
    &lt;BrokerReference&gt;SAB0513&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;1&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="3"&gt;
    &lt;BrokerReference&gt;ELD19010&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="4"&gt;
    &lt;BrokerReference&gt;DSI0012606&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="5"&gt;
    &lt;BrokerReference&gt;KWR0104&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="6"&gt;
    &lt;BrokerReference&gt;PRC2407&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="7"&gt;
    &lt;BrokerReference&gt;INC807&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;1&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="8"&gt;
    &lt;BrokerReference&gt;EDB0311&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
&lt;/Request&gt;</requestXML>
      <riskXML>&lt;Risk&gt;
  &lt;Policy&gt;
    &lt;CoverDate&gt;29/11/2014&lt;/CoverDate&gt;
    &lt;InsCancelled abiCode="N" /&gt;
    &lt;InsRefused abiCode="N" /&gt;
    &lt;ImposedTerms abiCode="N" /&gt;
    &lt;PrevPayment&gt;M&lt;/PrevPayment&gt;
    &lt;VolExcess&gt;50&lt;/VolExcess&gt;
    &lt;TotalVehiclesInHousehold&gt;5&lt;/TotalVehiclesInHousehold&gt;
  &lt;/Policy&gt;
  &lt;Person&gt;
    &lt;ContactEmail&gt;transformerPC10@emailreaction.org&lt;/ContactEmail&gt;
    &lt;ContactTelephone&gt;01734320300&lt;/ContactTelephone&gt;
    &lt;ContactAlternatePhone&gt;01734320300&lt;/ContactAlternatePhone&gt;
    &lt;Address1&gt;2 Duke of Edinburgh Way&lt;/Address1&gt;
    &lt;Address2&gt;Malvern&lt;/Address2&gt;
    &lt;Address3 /&gt;
    &lt;Address4 /&gt;
    &lt;PostCode&gt;WR14 1AZ&lt;/PostCode&gt;
    &lt;AnothersBus&gt;N&lt;/AnothersBus&gt;
    &lt;Commuting abiCode="Y" /&gt;
    &lt;EmpBus abiCode="N" /&gt;
    &lt;ExtendedUse abiCode="Y" /&gt;
    &lt;PersonalBus abiCode="Y" /&gt;
    &lt;PrivateHire abiCode="N" /&gt;
    &lt;PublicHire abiCode="N" /&gt;
    &lt;Soliciting abiCode="N" /&gt;
    &lt;CarriageOfGoods abiCode="N" /&gt;
    &lt;OtherOwnVehInd abiCode="N" /&gt;
    &lt;OtherOwnVehType /&gt;
    &lt;OtherCompanyVehInd abiCode="Y" /&gt;
    &lt;OtherVehProp /&gt;
    &lt;DriveOthVehicles abiCode="Y" /&gt;
    &lt;OtherCompanyVehSoleUse abiCode="Y" /&gt;
    &lt;DateMovedToUK&gt;1972-10-26&lt;/DateMovedToUK&gt;
    &lt;DateOfBirth&gt;26/10/1972&lt;/DateOfBirth&gt;
    &lt;DrvStatus abiCode="M" /&gt;
    &lt;FirstName&gt;Jacqui&lt;/FirstName&gt;
    &lt;Gender abiCode="F" /&gt;
    &lt;HasNonMotorConv abiCode="N" /&gt;
    &lt;HomeOwner abiCode="Y" /&gt;
    &lt;LicHeld&gt;10&lt;/LicHeld&gt;
    &lt;LicType abiCode="N" /&gt;
    &lt;LicUnit&gt;Y&lt;/LicUnit&gt;
    &lt;MotorOrg&gt;
      &lt;Organisation&gt;IAM&lt;/Organisation&gt;
    &lt;/MotorOrg&gt;
    &lt;MaritalStatus abiCode="M" /&gt;
    &lt;OtherCompanyVehYears&gt;10&lt;/OtherCompanyVehYears&gt;
    &lt;Surname&gt;Ten&lt;/Surname&gt;
    &lt;Title&gt;Mrs&lt;/Title&gt;
    &lt;Conviction&gt;
      &lt;ConvictionDate&gt;01/01/2012&lt;/ConvictionDate&gt;
      &lt;DisqualificationPeriod&gt;6&lt;/DisqualificationPeriod&gt;
      &lt;DisqualificationPeriodUnit&gt;M&lt;/DisqualificationPeriodUnit&gt;
      &lt;Fine&gt;150&lt;/Fine&gt;
      &lt;OffenceCode&gt;SP&lt;/OffenceCode&gt;
      &lt;OffenceCodeNumber&gt;10&lt;/OffenceCodeNumber&gt;
      &lt;OffenceDate /&gt;
      &lt;Points&gt;3&lt;/Points&gt;
    &lt;/Conviction&gt;
    &lt;Incident&gt;
      &lt;PercentRecovered&gt;0&lt;/PercentRecovered&gt;
      &lt;AtFault&gt;Y&lt;/AtFault&gt;
      &lt;IncidentType&gt;NoV&lt;/IncidentType&gt;
      &lt;BodilyInj abiCode="N" /&gt;
      &lt;ClaimDate&gt;01/05/2011&lt;/ClaimDate&gt;
      &lt;ClaimValue&gt;0.00&lt;/ClaimValue&gt;
      &lt;ClmType abiCode="T" /&gt;
      &lt;NCBAff&gt;Y&lt;/NCBAff&gt;
      &lt;Date&gt;01/05/2011&lt;/Date&gt;
    &lt;/Incident&gt;
    &lt;InfInd&gt;N&lt;/InfInd&gt;
    &lt;Occupation&gt;
      &lt;BusType abiCode="186" /&gt;
      &lt;EmpStat abiCode="N" /&gt;
      &lt;FullPart abiCode="Y" /&gt;
      &lt;OccType abiCode="220" /&gt;
    &lt;/Occupation&gt;
    &lt;PrivateMileage&gt;5000&lt;/PrivateMileage&gt;
    &lt;BusinessMileage&gt;5000&lt;/BusinessMileage&gt;
  &lt;/Person&gt;
  &lt;Person&gt;
    &lt;AnothersBus abiCode="N" /&gt;
    &lt;Commuting abiCode="N" /&gt;
    &lt;EmpBus abiCode="N" /&gt;
    &lt;ExtendedUse abiCode="N" /&gt;
    &lt;PersonalBus abiCode="N" /&gt;
    &lt;PrivateHire abiCode="N" /&gt;
    &lt;PublicHire abiCode="N" /&gt;
    &lt;Soliciting abiCode="N" /&gt;
    &lt;CarriageOfGoods abiCode="N" /&gt;
    &lt;OtherOwnVehInd abiCode="N" /&gt;
    &lt;OtherOwnVehType /&gt;
    &lt;OtherCompanyVehInd abiCode="N" /&gt;
    &lt;OtherVehProp /&gt;
    &lt;DriveOthVehicles abiCode="N" /&gt;
    &lt;DateMovedToUK&gt;1985-03-13&lt;/DateMovedToUK&gt;
    &lt;DateOfBirth&gt;13/03/1985&lt;/DateOfBirth&gt;
    &lt;DrvStatus abiCode="F" /&gt;
    &lt;FirstName&gt;Jessica&lt;/FirstName&gt;
    &lt;Gender abiCode="F" /&gt;
    &lt;HasNonMotorConv abiCode="N" /&gt;
    &lt;LicHeld&gt;4&lt;/LicHeld&gt;
    &lt;LicType abiCode="I" /&gt;
    &lt;LicUnit&gt;Y&lt;/LicUnit&gt;
    &lt;MaritalStatus abiCode="S" /&gt;
    &lt;Surname&gt;Ten&lt;/Surname&gt;
    &lt;Title&gt;Mrs&lt;/Title&gt;
    &lt;Incident&gt;
      &lt;PercentRecovered&gt;100&lt;/PercentRecovered&gt;
      &lt;AtFault&gt;N&lt;/AtFault&gt;
      &lt;IncidentType&gt;NoV&lt;/IncidentType&gt;
      &lt;BodilyInj abiCode="N" /&gt;
      &lt;ClaimDate&gt;01/05/2011&lt;/ClaimDate&gt;
      &lt;ClaimValue&gt;0.00&lt;/ClaimValue&gt;
      &lt;ClmType abiCode="W" /&gt;
      &lt;NCBAff&gt;N&lt;/NCBAff&gt;
      &lt;Date&gt;01/05/2011&lt;/Date&gt;
    &lt;/Incident&gt;
    &lt;InfInd&gt;N&lt;/InfInd&gt;
    &lt;Occupation&gt;
      &lt;BusType abiCode="186" /&gt;
      &lt;EmpStat abiCode="F" /&gt;
      &lt;FullPart abiCode="Y" /&gt;
      &lt;OccType abiCode="S50" /&gt;
    &lt;/Occupation&gt;
    &lt;RelationshipToProp abiCode="U" /&gt;
  &lt;/Person&gt;
  &lt;Vehicle&gt;
    &lt;ABICode&gt;16553803&lt;/ABICode&gt;
    &lt;AlarmSecurityFitted&gt;Unknown&lt;/AlarmSecurityFitted&gt;
    &lt;CoverType abiCode="01" /&gt;
    &lt;EstimatedValue&gt;3000&lt;/EstimatedValue&gt;
    &lt;Keeper abiCode="4" /&gt;
    &lt;Lhd&gt;N&lt;/Lhd&gt;
    &lt;Modified abiCode="N" /&gt;
    &lt;NCBType&gt;PC&lt;/NCBType&gt;
    &lt;NCBProtected&gt;N&lt;/NCBProtected&gt;
    &lt;NCBYears&gt;10&lt;/NCBYears&gt;
    &lt;NightLocation abiCode="3" /&gt;
    &lt;Owner abiCode="4" /&gt;
    &lt;OvernightPostCode&gt;WR14 1AZ&lt;/OvernightPostCode&gt;
    &lt;PurchaseDate&gt;01/09/2012&lt;/PurchaseDate&gt;
    &lt;Registration&gt;WM11ENP&lt;/Registration&gt;
    &lt;YearManufacture&gt;2011&lt;/YearManufacture&gt;
    &lt;Seats&gt;4&lt;/Seats&gt;
  &lt;/Vehicle&gt;
&lt;/Risk&gt;</riskXML>
    </ns1:getQuote>
  </soap:Body>
</soap:Envelope>